var cmData = {
        "കുഞ്ഞിമംഗലം ": {
                "ഷീബ കെ": "+919947528308"
        },
        "രാമന്തളി ": {
                "അനിൽ കുമാർ.പി ": "+919495728548"
        },
        "കാങ്കോൽ-ആലപ്പടമ്പ്‌": {
                "ബാബുരാജ്‌.എം.പി": "+919847427659"
        },
        "കരിവെള്ളൂർ": {
                "പവിത്രൻ.എം.വി": "+918281782765"
        },
        "എരമം കുറ്റൂർ": {
                "രമണി കെ": "+919496049022"
        },
        "പെരിങ്ങോം-വയക്കര": {
                "ടി.പി ശശീന്ദൻ": "+919496049023"
        }, "ചെറുപുഴ": {
                "നിഷാദ്‌": "+919895998477"
        },
        "പട്ടുവം": {
                "മൃദുല": "+919495772724"
        }, "കടന്നപ്പള്ളി": {
                "സജുലാൽ": "+919847598402"
        },
        "ചെങ്ങളായി": {
                "അനിത.കെ.പി": "+918129739026"
        }, "കുറുമാത്തൂർ": {
                "ജിതേഷ്‌.പി.കെ": "+919447373601"
        },
        "പരിയാരം": {
                "സന്തോഷ്കുമാർ.വിപി": "+919496049042"
        }, "ചപ്പാരപ്പടവ്‌": {
                "മംഗള.കെ.എൻ": "+919605413324"
        },
        "നടുവിൽ": {
                "ചിത്രൻ.കെ": "+919496049047"
        }, "ഉദയഗിരി": {
                "മോഹനൻ.എം.എ": "+919496049050"
        },
        "ആലക്കോട്‌": {
                "മോളി മാനുവേൽ": "+919496049051"
        }, "ചിറക്കൽ": {
                "നിസാർ": "+919744803792"
        },
        "വളപട്ടണം": {
                "ബാലകൃഷ്ണൻ.കെ": "+918848186875"
        }, "അഴീക്കോട്‌": {
                "അജയകുമാർ.ജി": "+919447961093"
        },
        "പാപ്പിനിശ്ശേരി": {
                "മനോജ്കുമാർ": "+919446365493"
        }, "കടമ്പൂർ": {
                "പ്രദീപർ.എൻ": "+919496049090"
        },
        "കൊളച്ചേരി": {
                "രാഹുൽ രാമചന്ദ്രൻ": "+919496049062"
        }, "ചെമ്പിലോട്‌": {
                "ബിന്ദു.എം": "+918157000488"
        },
        "മുണ്ടേരി": {
                "ലസിത.കെ.എ": "+919496708295"
        }, "പെരളശ്ശേരി": {
                "രജീഷ്‌": "+919496049100"
        },
        "ധർമ്മടം": {
                "പ്രേമൻ പി കെ": "+919496049102"
        },
        "എരഞ്ഞോളി": {
                "ശശീന്ദ്രൻ പി കെ": "+919495619416"
        },
        "അഞ്ചരക്കണ്ടി": {
                "സുജിത്ത് കെ ആർ": "+919847550308"
        },
        "മുഴപ്പിലങ്ങാട്": {
                "യൂസഫ്‌ എൻ കെ": "+919447014466"
        },
        "പിണറായി": {
                "വേണുഗോപാൽ എ കെ": "+919496049109"
        },
        "വേങ്ങാട്": {
                "പ്രീജിത്ത് എൻ": "+919946200321"
        },
        "ന്യൂ മാഹി": {
                "അർജുൻ പി": "+917902757067"
        },
        "കോട്ടയം": {
                "ഷീജ എം": "+919207517932"
        },
        "തൃപ്രങ്ങോട്ടൂർ": {
                "രമേശ് പി കെ": "+919447012109"
        },
        "ചിറ്റാറിപ്പറമ്പ്": {
                "സുഗതൻ എം": "+919745358075"
        },
        "കുന്നോത്തുപറമ്പ്": {
                "പ്രസാദ് വി വി": "+919496049130"
        },
        "മാങ്ങാട്ടിടം": {
                "സനോജ് ടി കെ": "+919745012133"
        },
        "പാട്യം": {
                "ശ്രീജ എസ് പുത്തൻപുരയിൽ": "+9495796007"
        },
        "ആറളം": {
                "ഫ്രാൻസിസ് ആർ": "+919447504022"
        },
        "അയ്യൻകുന്ന്": {
                "ബിനു വർഗ്ഗീസ്": "+919496049140"
        },
        "കീഴല്ലൂർ": {
                "ഷംന കെ വി": "+919497142824"
        },
        "തില്ലങ്കേരി": {
                "രമേശൻ പി കെ": "+919446413480"
        },
        "കൂടാളി": {
                "രാജൻ കെ": "+919496049146"
        },
        "പായം": {
                "മൃദുല": "+918281981183"
        },
        "കണിച്ചാർ": {
                "സാദിഖ് എസ് സി": "+919446836311"
        },
        "കേളകം": {
                "വിനോദ് പി കെ": "+919496049154"
        },
        "കൊട്ടിയൂർ": {
                "സൂരജ് കെ എസ്": "+919495667491"
        },
        "മുഴക്കുന്ന്": {
                "രജി പി മാത്യൂ": "+918848213124"
        },
        "കോളയാട്": {
                "ദാസൻ നിട്ടൂർ": "+919495770947"
        },
        "മാലൂർ": {
                "രജനി കെ": "+919497840696"
        },
        "ഇരിക്കൂർ": {
                "രാജേഷ് പി കെ": "+919447934417"
        },
        "ഏരുവേശ്ശി": {
                "ഗ്രേസി ജോസഫ്": "+919446150959"
        },
        "മലപ്പട്ടം": {
                "സജിവേന്ദ്രൻ വി എ": "+919656475346"
        },
        "പയ്യാവൂർ": {
                "ഷീനാകുമാരി പാല": "+919496049060"
        },
        "കുറ്റ്യാട്ടൂർ ": {
                "ഉണ്ണികൃഷ്ണൻ ടി പി": "+919496049064"
        },
        "മയ്യിൽ": {
                "പ്രകാശൻ പി ": "+918281010751"
        },
        "പടിയൂർ": {
                "അനിൽ രാമകൃഷ്ണൻ ": "+918547123443"
        },
        "ഉളിക്കൽ": {
                "ജോർജ്ജ്": "+919745465704"
        },
        "ചെറുതാഴം ": {
                "മധുസൂദനൻ കെ": "+919947540361"
        },
        "ഏഴോം": {
                "അനിൽ": "+919744876008"
        },
        "മാടായി ": {
                "എം വി ചന്ദ്രൻ": "+919496049010"
        },
        "മാട്ടൂൽ": {
                "ശിവദാസൻ": "+919947839765"
        },
        "ചെറുകുന്ന്": {
                "ഷിബു കരുൺ": "+919895624239"
        },
        "കല്യാശ്ശേരി": {
                "ശ്രീജയ ടി പി": "+918848042662"
        },
        "കണ്ണപുരം": {
                "നിത കൃഷ്ണ": "+919497861355"
        },
        "നാറാത്ത്": {
                "ഷിബിന": "+919746453656"
        },
        "പന്ന്യന്നുർ": {
                "ശൈലജ": "+919496049121"
        },
        "കതിരൂർ": {
                "സുജിത്ത് കുമാർ പി": "+919496049106"
        },
        "ചൊക്ലി": {
                "സുധീഷ് പി കെ": "+919895084540"
        },
        "മൊകേരി": {
                "ലസിത കെ എൻ": "+919400564744"
        }
};
var data = JSON.stringify(cmData);
var obj = JSON.parse(data);
var panjayth = Object.keys(obj);
var panj;


console.log(panjayth);

var name = Object.keys(obj[panjayth[0]]);
console.log(name);
var phone = obj[panjayth[0]][name];
console.log(phone);
var cmTable = ` 
            
      <table class="table table-striped table-hover" style="margin-left: -16px;">
          <tr>
              <th class="success">No</th>
              <th class="success">പഞ്ചായത്തിന്റെ പേര്</th>
              <th class="success">സന്നദ്ധസേവകന്റെ പേര്</th>
              <th class="success">ഭക്ഷണം വേണ്ടവർ ബന്ധപ്പെടേണ്ട  നമ്പർ</th>
          </tr>`

for (i in panjayth) {
        panj = panjayth[i];//panjayath
        name = Object.keys(obj[panj]);//name of respected person
        phone = obj[panj][name];//phone number
        cmTable += `
        <tr>
              <td>${parseInt(i) + 1}</td>
              <td class="text-left">${panj}</td>
              <td class="text-left">${name}</td>
              <td style="color: limegreen;">${phone}</td>
        </tr>`;
}
cmTable += "</table>";
document.getElementById("cmTable").innerHTML = cmTable;
